<?php



return [



    // Arabic Translation
    'verify_email_title' => 'تأكيد البريد الإلكتروني لدرع أمني',
    'verify_email_heading' => 'تأكيد البريد الإلكتروني لدرع أمني',
    'verify_email_hello' => 'مرحبًا :userName،',
    'verify_email_thank_you' => 'شكرًا لاختيار درع أمني. تم إنشاء هذا التطبيق لتسهيل تجربة مستخدمينا في إدارة متطلبات مشاريعهم.',
    'verify_email_complete_registration' => 'لإكمال التسجيل والوصول إلى حسابك، نرجو منك تأكيد بريدك الإلكتروني. تأكيد بريدك يسهم في أمان حسابك ويتيح لك الوصول إلى مزايا كاملة.',
    'verify_email_otp_token' => 'الرمز الذي تحتاج إليه: :token',
    'verify_email_click_link' => 'يمكنك أيضًا النقر على الرابط أدناه لبدء عملية التأكيد:',
    'verify_email_verify_btn' => 'تأكيد البريد الإلكتروني',
    'verify_email_note_1' => 'يرجى ملاحظة أن رسالة التحقق برمز OTP تعتمد على الوقت ولا يمكن إعادة استخدامها لمحاولات التحقق المستقبلية.',
    'verify_email_note_2' => 'نهتم بخصوصيتك وأمان بياناتك في درع أمني. يتم توليد رمز فريد لكل طلب تحقق لأمانك.',
    'verify_email_privacy' => 'إذا كنت بحاجة للمساعدة، فإن فريق الدعم لدينا هنا لمساعدتك في كل خطوة من الطريق.',
    'verify_email_note_3' => 'أنت بأمان! نحن هنا لضمان خصوصيتك وتجربة آمنة.',
    'verify_email_support' => 'نتطلع إلى خدمتك في درع أمني، ونأمل أن تكون تجربتك إدارة متطلباتك سهلة وفعّالة.',
    'verify_email_we_look_forward' => 'أطيب التحيات، فريق درع أمني',
    'verify_email_best_regards' => 'نتطلع إلى خدمتك في درع أمني، ونأمل أن تكون تجربتك مرضية في إدارة احتياجاتك.',
    'verify_email_thanks' => 'شكرًا لك،',


    'Notifications' => 'الإشعارات',
    'payment_success' => '      تم الدفع بنجاح     ',

    'Languagepreferenceupdatedsuccessfully' => 'Language preference updated successfully.',

    'resend' => 'إعادة إرسال',
    'payment_successfull' => 'تم الدفع بنجاح',
    'account_not_verified' => 'حسابك غير موثق. يرجى تفعيل حسابك من خلال التحقق من البريد الإلكتروني للمتابعة.',
    'Payment Successful for bill number ' => 'تم الدفع بنجاح لرقم الفاتورة ',

    'forgot_password_title' => 'نسيت كلمة المرور',
    'verify_email' => 'تحقق من البريد الإلكتروني',
    'enter_email' => 'الرجاء إدخال عنوان بريدك الإلكتروني:',
    'email_placeholder' => 'بريدك الإلكتروني',
    'submit' => 'إرسال',
    'enter_received_code' => 'أدخل الرمز المؤلف من 6 أرقام المرسل إلى بريدك الإلكتروني:',
    'resend_code' => 'إعادة إرسال الرمز',
    'verify_code' => 'التحقق من الرمز',
    'enter_new_password' => 'أدخل كلمة المرور الجديدة:',
    'confirm_new_password' => 'تأكيد كلمة المرور الجديدة:',
    'save_password' => 'حفظ كلمة المرور',
    'login' => 'تسجيل الدخول',

    'cash' => 'نقداً',
    'payment_details' => 'تفاصيل الدفع',
    'visit_office_message' => 'الرجاء الذهاب إلى مكتبنا في شارع الرئيسي 123، المدينة، البلد',
    'working_hours' => 'ساعات العمل',
    'mon_fri_hours' => 'من الاثنين إلى الجمعة: من الساعة 9 صباحًا حتى الساعة 6 مساءً',
    'contact_number' => 'رقم الاتصال',
    'how_to_payment' => 'كيفية الدفع',
    'how_to_payment_description' => 'عندما تصل إلى المكتب، قدم اسم المستخدم وكلمة المرور الخاصة بالمشرف والمال... واستلم الفواتير منه وتأكد من أن حسابك يعمل.. إذا كان الورق والمعلومات صحيحة',
    'back' => 'رجوع',


    'search_placeholder' => 'ابحث...',
    'search_button' => 'بحث',
    'consultants' => 'الاستشاريون',

    'all_companies' => 'جميع الشركات',

    'payment_methods_heading' => 'طرق الدفع',
    'how_to_pay' => 'كيف تريد الدفع؟',
    'credit_debit' => 'بطاقة الائتمان / الخصم',
    'paypal' => 'باي بال',
    'cash' => 'نقداً',
    'one_bill_message' => 'يمكنك فقط الحصول على فاتورة واحدة، الرجاء الانتقال إلى الصفحة الرئيسية',
    'bill_number' => 'رقم الفاتورة',
    'paid_at' => 'تم الدفع',


    'post_stored_success' => 'تم حفظ المنشور بنجاح.',
    'comment_stored_success' => 'تم حفظ التعليق بنجاح.',
    'An error occurred while submitting your message. Please try again later.' => 'حدث خطأ أثناء إرسال رسالتك. يرجى المحاولة مرة أخرى لاحقًا.',
    'Your message has been submitted successfully. We will get back to you soon!' => 'تم إرسال رسالتك بنجاح. سنعود إليك قريبًا!',
    'services_title' => 'الخدمات',
    'service_1_name' => '1-البناء والتشييد',
    'service_1_description' => 'شركات بناء محترفة تقوم بتنفيذ مشاريع البناء، بما في ذلك المشاريع السكنية والتجارية والبنية التحتية.',
    'service_1_button' => 'مشاهدة المزيد',
    'service_2_name' => '2-مركز رياضي',
    'service_2_description' => 'مرافق تقدم مجموعة من الأنشطة الرياضية والمعدات وبرامج التدريب لتعزيز اللياقة البدنية ونمط حياة نشط.',
    'service_2_button' => 'مشاهدة المزيد',
    'service_3_name' => '3-مكافحة الآفات',
    'service_3_description' => 'خدمات متخصصة تقضي على وتمنع انتشار الآفات مثل الحشرات والقوارض والنمل الأبيض.',
    'service_3_button' => 'مشاهدة المزيد',
    'service_4_name' => '4-العقارات',
    'service_4_description' => 'قطاع يتعامل مع شراء وبيع وتأجير العقارات بما في ذلك المنازل والشقق والمساحات التجارية.',
    'service_4_button' => 'مشاهدة المزيد',
    'service_5_name' => '5-التأمين',
    'service_5_description' => 'شركات تقدم حماية وتغطية ضد مخاطر مختلفة، وتوفر الأمان المالي والطمأنينة النفسية.',
    'service_5_button' => 'مشاهدة المزيد',
    'service_6_name' => '6-مركز سبا',
    'service_6_description' => 'مؤسسات مريحة تقدم علاجات سبا مجددة للروح، بما في ذلك المساج والتجميل والعلاجات الجسدية.',
    'service_6_button' => 'مشاهدة المزيد',
    'service_7_name' => '7-تأجير السيارات',
    'service_7_description' => 'خدمات توفر وصولًا مؤقتًا للمركبات للأفراد الذين يحتاجون إلى وسيلة مواصلات لفترة معينة.',
    'service_7_button' => 'مشاهدة المزيد',
    'service_8_name' => '8-التنظيف',
    'service_8_description' => 'خدمات تنظيف محترفة تضمن النظافة والنظافة في المنازل والمكاتب والبيئات الأخرى.',
    'service_8_button' => 'مشاهدة المزيد',
    'service_9_name' => '9-الأمان والحماية',
    'service_9_description' => 'شركات تقدم حلول أمان، بما في ذلك أنظمة المراقبة وأنظمة الإنذار والموظفين المدربين لحماية الأفراد والممتلكات.',
    'service_9_button' => 'مشاهدة المزيد',
    'service_10_name' => '10-تنظيف السجاد',
    'service_10_description' => 'خدمة محترفة تزيل الأوساخ والبقع من السجاد، وتجعله نظيفًا ومنتعشًا.',
    'service_10_button' => 'مشاهدة المزيد',
    'service_11_name' => '11-تعليم القيادة',
    'service_11_description' => 'مدربون معتمدون يقدمون دروس قيادة شاملة وتدريب للمساعدة في اكتساب مهارات القيادة والحصول على رخص القيادة.',
    'service_11_button' => 'مشاهدة المزيد',
    'service_12_name' => '12-توصيل المياه',
    'service_12_description' => 'خدمة مريحة توصل المياه العذبة والنقية مباشرة إلى المنازل أو الشركات.',
    'service_12_button' => 'مشاهدة المزيد',
    'service_13_name' => '13-مركز التجميل',
    'service_13_description' => 'مكان يمكن للأفراد أن يحصلوا فيه على مجموعة متنوعة من علاجات الجمال مثل تصفيف الشعر والمانيكير والباديكير والتجميل.',
    'service_13_button' => 'مشاهدة المزيد',
    'service_14_name' => '14-شركات الشحن',
    'service_14_description' => 'شركات تقدم خدمات نقل موثوقة لشحن السلع والطرود محليًا أو دوليًا.',
    'service_14_button' => 'مشاهدة المزيد',
    'service_15_name' => '15-شركات السياحة',
    'service_15_description' => 'مؤسسات تقدم خدمات السفر والجولات السياحية، وتقدم تجارب لا تنسى وإرشادات لاستكشاف وجهات مختلفة.',
    'service_15_button' => 'مشاهدة المزيد',
    'service_16_name' => '16-عمال المنازل',
    'service_16_description' => 'محترفون ماهرون يساعدون في أعمال المنزل مثل التنظيف والطهي والحفاظ على بيئة معيشية نظيفة.',
    'service_16_button' => 'مشاهدة المزيد',
    'service_17_name' => '17-نقل الأثاث',
    'service_17_description' => 'محترفون في نقل الأثاث بأمان وكفاءة من مكان إلى آخر.',
    'service_17_button' => 'مشاهدة المزيد',
    'service_18_name' => '18-مركز اللغات',
    'service_18_description' => 'مؤسسة تعليمية تقدم دورات لغة للمساعدة في   درع أمني  مهارات التحدث بلغات مختلفة.',
    'service_18_button' => 'مشاهدة المزيد',

    // ...
    'site_title' => 'مشاركات   درع أمني ',
    'dashboard' => [
        'title' => 'لوحة التحكم',
        'logged_in_message' => 'لقد تم تسجيل دخولك!',
    ],
    'filter' => [
        'title' => 'تصفية',
        'start_date' => 'تاريخ البدء',
        'end_date' => 'تاريخ الانتهاء',
        'show_result' => 'عرض النتيجة',
    ],
    'more' => 'المزيد',
    'companies' => 'الشركات',
    'Security Shield' => '  درع أمني ',
    'home' => 'الرئيسية',
    'dashboard_company' => 'لوحة تحكم الشركة',
    'dashboard_user' => 'لوحة تحكم المستخدم',
    #########################################################################
    'consultant' => 'استشاريين',
    'general_contractor' => 'مقاولين عام',
    'subcontractor' => 'مقاوليين باطن',
    'supplier' => 'موردين',
    'my_posts' => 'مشاركاتي',
    'new_post' => 'مشاركة جديدة',
    'logout' => 'تسجيل الخروج',
    'profile' => 'الملف الشخصي',
    'name' => 'الاسم',
    'contact_number' => 'رقم الاتصال',
    'email' => 'البريد الإلكتروني',
    'emirate_city' => 'الإمارة/المدينة',
    'create_post' => 'إنشاء منشور',
    'subject' => 'الموضوع:',
    'description' => 'الوصف',
    'describe_here' => 'صف هنا.',
    'attach_files' => 'إرفاق الملفات',
    'drag_drop_files' => 'قم بسحب وإفلات أي صور أو مستندات قد تدعم وصفك (حجم الملف الأقصى: 25 ميجابايت).',
    'who_would_see_post' => 'من ترغب في رؤية المنشور الخاص بك؟',
    'all' => 'الكل',
    'publish' => 'نشر',
    'select_subcontractor' => 'اختر المقاول الباطن',
    'tell_us_what_you_need' =>  'أخبرنا بما تحتاجه',
    'show_post' => 'عرض المنشور',
    'file_uploaded_success' => 'تم تحميل الملف بنجاح!',
    'close' => 'إغلاق',
    'about_the_client' => 'حول العميل',
    'post_created_success' => 'تم إنشاء المنشور بنجاح!',
    'write_comment' => 'اكتب تعليقًا',
    'reply' => 'الرد',
    'company_name' => 'اسم الشركة',
    'responsible_name' => 'اسم المسؤول',
    'prof_user' => 'ملف تعريف المستخدم',
    'edit_personal_info' => 'تعديل المعلومات الشخصية أدناه',

    'responsible_person' => 'الشخص المسؤول',
    'role_job' => 'الدور / الوظيفة',
    'phone' => 'رقم الهاتف',
    'password' => 'كلمة المرور',
    'language' => 'اللغة',
    'english' => 'الإنجليزية',
    'arabic' => 'العربية',
    'update' => 'تحديث',




    'minutes_ago' => '{1} منذ دقيقة|[2,*] منذ :count دقائق',
    'hours_ago' => '{1} منذ ساعة|[2,*] منذ :count ساعات',
    'days_ago' => '{1} منذ يوم|[2,*] منذ :count أيام',
    'weeks_ago' => '{1} منذ أسبوع|[2,*] منذ :count أسابيع',
    'months_ago' => '{1} منذ شهر|[2,*] منذ :count أشهر',
    'years_ago' => '{1} منذ سنة|[2,*] منذ :count سنوات',


    'consultant_posts' => 'مشاركات المستشار',
    'filter' => 'تصفية',

    'date' => 'التاريخ',
    'start_date' => 'تاريخ البدء',
    'end_date' => 'تاريخ الانتهاء',
    'show_result' => 'عرض النتائج',
    'electrical_engineering' => 'هندسة كهربائية',
    'ceramic_installation' => 'تركيب السيراميك',
    'plumbing_department' => 'قسم السباكة',
    'decoration_works' => 'أعمال الديكور',
    'reinforced_carpentry' => 'نجارة مدعمة',
    'elevator_works' => 'أعمال المصعد',
    'reinforced_ironworks' => 'أعمال الحديد المدعم',
    'pasco_installation' => 'تركيب بأسكو',
    'brick_installation' => 'تركيب الطوب',
    'ornamental_ironworks' => 'أعمال الحديد الزخرفي',
    'plastering_works' => 'أعمال التجصيص',
    'stone_installation' => 'تركيب الحجر',
    'painting_works' => 'أعمال الطلاء',
    'aluminum_and_glass_works' => 'أعمال الألمنيوم والزجاج',
    'door_carpentry' => 'نجارة الأبواب',
    'air_conditioning_works' => 'أعمال التكييف',
    'civil_defense_works' => 'أعمال الدفاع المدني',
    'suspended_ceiling_works' => 'أعمال السقف المعلق',


    'login' => 'الدخول',

    'terms_condition' => 'الشروط والأحكام',

    'services' => 'الخدمات',
    'features' => 'الميزات',
    'about_us' => 'من نحن',
    'contact_us' => 'اتصل بنا',


    'welcome' => 'مرحبًا بك في موقعنا',
    'choose_section' => 'اختر قسمًا من الأقسام أدناه للبدء',
    'constructions' => 'الإنشاءات',
    'join_users' => 'انضم إلى مئات العملاء ..المستشارين والمقاولين العامين والمقاولين الفرعيين والموردين',

    'message' => 'الرسالة',
    'write_message' => 'اكتب رسالتك هنا...',
    'send' => 'إرسال',
    'link1' => 'الرابط 1',
    'link2' => 'الرابط 2',
    'link3' => 'الرابط 3',
    'location' => '
الإمارات العربية المتحدة ، أبو ظبي ، العين',
    'business_hours' => 'ساعات العمل: 24 ساعة',
    'cp_rights' => 'جميع الحقوق محفوظة لشركة   درع أمني ',


    'features_title' => '  درع أمني ',
    'terms_conditions_privacy_policy' => 'الشروط والأحكام وسياسة الخصوصية',
    'first_policy' => 'السياسة الأولى: نحن نلتزم بحماية خصوصية زوارنا ومستخدمينا. نحن نجمع المعلومات الشخصية فقط بغرض تحسين تجربتهم وتقديم خدمات أفضل. نحن لا نقوم بمشاركة أو بيع المعلومات الشخصية لأطراف ثالثة.',
    'second_policy' => 'السياسة الثانية: نحن نلتزم بتأمين المعلومات التي يقدمها مستخدمونا عبر الموقع. نحن نستخدم تقنيات حديثة لحماية البيانات وتأمينها من الوصول غير المصرح به. كما نحرص على إجراء التحديثات الدورية للحفاظ على أمان المعلومات.',
    'third_policy' => 'السياسة الثالثة: نحن نلتزم بتوفير خدمة عالية الجودة وموثوقة للمستخدمين. نحن نعمل على تحسين الموقع و  درع أمني ه بشكل مستمر لضمان تلبية احتياجات العملاء. كما نسعى لتوفير تجربة مستخدم مريحة وسهلة الاستخدام.',
    'fourth_policy' => 'السياسة الرابعة: نحن نحترم حقوق الملكية الفكرية للآخرين ونطلب من مستخدمينا الامتناع عن نسخ أو توزيع المحتوى المتاح على الموقع بدون إذن. نحن نحتفظ بحقوقنا في جميع المحتويات المنشورة على الموقع ونحظر استخدامها بأي شكل من الأشكال دون إذن كتابي.',





    'save_money' => 'وفّر المال',
    'unlock_benefits' => 'احصل على فوائد حصرية',
    'register' => 'التسجيل',
    'save_time' => 'وفّر الوقت',
    'save_time_join' => 'وفّر الوقت من خلال الانضمام إلى منصتنا',
    'improve_business' => 'طوّر عملك',
    'join_community' => 'انضم إلى مجتمعنا وطوّر عملك',
    'reduce_effort' => 'قلّل الجهد',
    'dont_miss_out' => 'لا تفوّت الفرصة لتقليل جهودك',
    'high_privacy' => 'خصوصية عالية',
    'friendly_prices' => 'أسعار معقولة',
    'high_quality_work' => 'جودة عالية في العمل',
    'high_performance' => 'أداء عالي',
    'easy_to_use' => 'سهل الاستخدام',
    'for_all_devices' => 'لجميع الأجهزة',
    'why_use_Security Shield' => 'لماذا تستخدم   درع أمني ؟',
    'why_use_Security Shield_description' => 'نحن نوفر خصوصية عالية، أسعار معقولة، جودة عالية في العمل، أداء عالي ومنصة سهلة الاستخدام لجميع الأجهزة.',
    'learn_more' => 'اعرف المزيد',
    'watch_video' => 'شاهد الفيديو',
    'complete_projects' => 'الخدمات المفتوحه',
    'happy_clients' => 'افراد',
    'on_going_projects' => 'المشاريع الجارية',
    'official_companies' => 'الشركات الرسمية',
    'about_us_description' => 'نحن (شركة خدمات   درع أمني ) المسجلة في دولة الإمارات العربية المتحدة ، مدينة العين وتأسست في مايو 2023.

تم إنشاء هذا الموقع الإلكتروني لتسهيل وتسريع وتحسين تجربة عملاء   درع أمني  من خلال استخدام الخدمات المختلفة التي تم إعدادها خصيصًا على الموقع.

نحن الطرف الثالث بين العملاء والشركات التي تقدم الخدمات.',
    'how_it_works' => 'كيف تعمل',

    'write_message_here' => 'اكتب رسالتك هنا...',

    'address' => 'العنوان',


    // Corresponding translations for user register blade
    'sign_up_users' => 'التسجيل-العملاء',
    'get_started_now' => 'ابدأ الآن!',
    'registration' => 'التسجيل',
    'individual' => 'فردي',
    'company' => 'شركة',

    'confirm_password' => 'تأكيد كلمة المرور',
    'nationality' => 'الجنسية',
    'birth_date' => 'تاريخ الميلاد',
    'identity_card' => 'بطاقة الهوية',
    'profile_image' =>  'صورة الملف الشخصي',
    'accept_terms' => 'أوافق على الشروط والأحكام وسياسة الخصوصية',
    'sign_up' => 'إنشاء حساب',
    'have_account' => 'هل لديك حساب؟ ',
    'have_accountII' => 'سجل الأن',
    'Security Shield_en' => 'شركة   درع أمني  الخدمات الإلكترونية',
    'website_description' => 'تم إنشاء هذا الموقع لتسهيل وتسريع وتحسين تجربة عملاء   درع أمني  من خلال استخدام مجموعة متنوعة من الخدمات التي تم إعدادها خصيصًا على الموقع.',
    'register_description' => 'إذا كنت مسجلًا بالفعل على الموقع، يرجى :login_link وإدخال اسم المستخدم وكلمة المرور الخاصة بك. إذا لم تكن مسجلاً بعد وكنت مستخدمًا جديدًا، يرجى :register_link واستكمال المعلومات.',

    // other translations...

    'login_link' => '<a class="color-b" href=>تسجيل الدخول</a>',
    'register_link' => '<a class="color-b" href=>التسجيل</a>',

    'lets_start' => 'لنبدأ ونستمتع!',



    'remember_me' => 'تذكرني',
    'forgot_password' => 'نسيت كلمة المرور؟',
    'log_in' => 'الدخول',
    'dont_have_account' => 'ليس لديك حساب؟',
    'sign_up_now' => 'سجّل الآن',
    'Security Shield_ar' => '  درع أمني  للخدمات الإلكترونية',
    'services_website_description' => 'من خلال استخدام خدماتنا، ستتمكن من ...',
    'by_using_our_services' => 'من خلال استخدام خدماتنا، ستتمكن من ...',

    'company_register' => 'تسجيل الشركة',

    'registration_type' => 'نوع التسجيل*',
    'specialization' => 'التخصص*',
    'professional_license' => 'الرخصة المهنية*',
    'i_accept' => 'أوافق',
    'terms_conditions' => 'شروط الاستخدام وسياسة الخصوصية',
    'have_an_account' => 'لديك حساب؟',
    'have_an_accountII' => 'سجّل الآن',
    'log_in_now' => 'سجّل الآن',
    'website_facilitate_accelerate' =>
    'تم إنشاء هذا الموقع لتسهيل وتسريع وتحسين تجربة عملاء   درع أمني  من خلال استخدام الخدمات المختلفة التي تم إعدادها بشكل خاص على الموقع.',
    'if_registered' => 'إذا كنت مسجلاً بالفعل على الموقع ، يرجى "تسجيل الدخول" وإدخال اسم المستخدم وكلمة المرور الخاصة بك. إذا لم تكن مسجلاً بعد وكنت مستخدمًا جديدًا ، فيرجى إنشاء حساب على الموقع عن طريق تحديد "التسجيل" واستكمال المعلومات.',



    'dont_have_an_account' => 'ليس لديك حساب؟',

    'website_allow_customers' => 'مرحبًا بك في موقعنا الإلكتروني للخدمات الإلكترونية الذي يتيح لعملائنا الكرام عرض واستخدام العديد من الخدمات عبر الإنترنت بطريقة سهلة.',
    'lets_start_and_enjoy' => 'لنبدأ ونستمتع!',

    'welcome_to_Security Shield' => 'مرحبًا بكم في موقع خدماتنا الإلكترونية الذي يسمح لعملائنا الكرام بعرض واستخدام العديد من الخدمات عبر الإنترنت بطريقة سهلة',



];
